/*
(斐波那契)数列指的是这样一个数列：1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,1597,2584,
4181,6765,17711,28657,46368... ...
这个数列从第3项开始，每一项都等于前两项之和。
这个数列前2项是1，从第3项开始，每一项都等于前两项之和。
*/

#include<stdio.h>
int main() {

	int n, i;

	scanf("%d", &n);
	int a = 1, b = 1;
	for (i = 1; i <= n; i++) {
		if (i == 1) {
			printf("1");
		}
		else if (i == 2) {
			printf(",1");
		}
		else {
			
			int sum = 0;
			sum = a + b;
			printf(",%d", sum);
			a = b;
			b = sum;
		}
	}

	return 0;
}
